import * as Yup from 'yup'

export const purchaseValidationStepOne = Yup.object({
  'First Name': Yup.string()
    .min(2, 'Ім’я повинно бути не менше 2 знаків')
    .max(30, 'Ім’я повинно бути не більше 30 знаків')
    .required('Введіть ім’я'),
  'Last Name': Yup.string()
    .min(2, 'Прізвище повинно бути не менше 2 знаків')
    .max(50, 'Прізвище повинно бути не більше 50 знаків')
    .required('Введіть своє прізвище'),
  Email: Yup.string()
    .matches(
      /^[a-zA-Z0-9._-]+@([a-zA-Z]+[-])*[a-zA-Z]+(\.[a-zA-Z]{2,4})+$/,
      'Невірна електронна пошта'
    )
    .required('Введіть електронну пошту'),
  PhoneNumber: Yup.string()
    .max(16, 'Невірний формат телефону. Правильний формат: +380#########')
    .matches(
      /^\+380\d{2}\d{3}\d{4}$/,
      'Невірний формат номеру. Приклад: +380#########'
    ),
  'Shipping Adress': Yup.string()
    .matches(/.*\S+.*/, 'Введіть ваше повідомлення')
    .min(10, 'Повідомлення повинно бути не менше 10 знаків')
    .max(300, 'Повідомлення повинно бути не більше 300 знаків')
    .required('Введіть ваше повідомлення'),
  'Shipping Adress 2': Yup.string()
    .min(10, 'Повідомлення повинно бути не менше 10 знаків')
    .max(300, 'Повідомлення повинно бути не більше 300 знаків')
})
